Reports/ЛБ_ОтклонениеКассовыхЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ОтклонениеКассовыхЛимитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_КассовыеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КассовыеЛимиты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РассчетныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_ОтклонениеКассовыхЛимитов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ДатаКон = ТекущаяДата();
КонецПроцедуры

//&НаКлиенте
//Процедура Интервал(Команда)
//	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
//	
//	Если ДиалогРедактирования.Редактировать() Тогда
//		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
//		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ОтделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Имя)
	ПараметрыФормы = новый структура;
	ПараметрыФормы.Вставить(Имя, Истина);
	ПараметрыФормы.Вставить("Дата", ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон)));
	
	Если Имя = "Отделение" Тогда
		ПараметрыФормы.Вставить("Список", Отчет.Отделение);
	Иначе
		ПараметрыФормы.Вставить("Список", Отчет.Ломбард);
	КонецЕсли;
	
	ОповещениеПослеВыборка = Новый ОписаниеОповещения("ПослеВыбораЗначений", ЭтаФорма); 
	ОткрытьФорму("Отчет.ЛБ_ОтклонениеКассовыхЛимитов.Форма.ФормаВыбораЗначений", ПараметрыФормы, Этаформа,,,,ОповещениеПослеВыборка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначений(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора <> Неопределено И РезультатВыбора.Количество() > 0 Тогда
		
	  //СсылкаЕкт = ПолучитьСсылкуОтделения("Екатеринбург");
		Отчет.Отделение.Очистить();
		Отчет.Ломбард.Очистить();
		
		Если ТипЗнч(РезультатВыбора[0]) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Для каждого Стр Из РезультатВыбора Цикл
				//Если РезультатВыбора.Количество() > 1 И Стр = СсылкаЕкт Тогда
				//	Продолжить;
				//Иначе
					Отчет.Отделение.Добавить(Стр);
				//КонецЕсли;
			КонецЦикла;
		Иначе
			//ЕстьЦО = РезультатВыбора.Найти(ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис")) <> Неопределено;
			//
			//ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
			//
			//ТолькоЕкт = ПроверитьСписокВыбора(ДатаКон, РезультатВыбора, СсылкаЕкт);
			//
			//ЛомбардыЕкт = Новый Массив;
			//
			//Если НЕ ТолькоЕкт Тогда
			//	ЛомбардыЕкт = ПолучитьСписокЛомбардовЕкт(ДатаКон, СсылкаЕкт);
			//КонецЕсли;
			
			Для каждого Стр Из РезультатВыбора Цикл
				//Если НЕ ТолькоЕкт ИЛИ ЕстьЦО Тогда
				//	Если НЕ ТолькоЕкт Тогда
				//		НайденныеСтроки = ЛомбардыЕкт.Найти(Стр);
				//	КонецЕсли;
				//	
				//	Если НайденныеСтроки <> Неопределено ИЛИ Стр = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
				//		Продолжить;
				//	Иначе
				//		Отчет.Ломбард.Добавить(Стр);
				//	КонецЕсли;
				//Иначе
					Отчет.Ломбард.Добавить(Стр);
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДействующиеЛимиты";
	
	Макет = Отчет.РеквизитМакет;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ПериодОтчетаТекст = "на " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	
	ОбластьШапка.Параметры.Период = ПериодОтчетаТекст;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Результат.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КассовыеЛимитыСрезПоследних.Отделение КАК Отделение,
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард.НомерЛомбарда КАК НомерЛомбарда,
	               |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит,
	               |	ЛБ_ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА ЛБ_ДенежныеСредстваОстатки.СуммаОстаток > ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит
	               |			ТОГДА ЛБ_ДенежныеСредстваОстатки.СуммаОстаток - ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит
	               |		ИНАЧЕ ""-""
	               |	КОНЕЦ КАК Отклонение
	               |ИЗ
	               |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&Дата, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛБ_ДенежныеСредства.Остатки(
	               |				&Дата,
	               |				ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
	               |					И Ломбард В (&Ломбард)) КАК ЛБ_ДенежныеСредстваОстатки
	               |		ПО ЛБ_КассовыеЛимитыСрезПоследних.Ломбард = ЛБ_ДенежныеСредстваОстатки.Ломбард
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_КассовыеЛимитыСрезПоследних.Отделение.Наименование,
	               |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард.НомерЧисловой";

	Запрос.УстановитьПараметр("Дата", ДатаКон);

	Если ЗначениеЗаполнено(Отчет.Ломбард) Тогда
		Запрос.УстановитьПараметр("Ломбард", Отчет.Ломбард);
	Иначе
		Запрос.УстановитьПараметр("Ломбард", ПолучитьСписокЛомбардов(ДатаКон, ?(ЗначениеЗаполнено(Отчет.Отделение), Отчет.Отделение.ВыгрузитьЗначения(), Неопределено)));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ИтогоОтклонение = 0;
	Нпп = 0;
	Для каждого Стр Из РезультатЗапроса Цикл
		Если ПроверкаЧислаНаЧетность(Нпп) Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЧет");
		Иначе
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНечет");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Стр);
		Результат.Вывести(ОбластьСтрока);
		
		Если Стр.Отклонение <> "-" Тогда
			ИтогоОтклонение = ИтогоОтклонение + Стр.Отклонение;
		КонецЕсли;
		
		Нпп = Нпп + 1;
	КонецЦикла;

	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоФактическийЛимит = РезультатЗапроса.Итог("ФактическийЛимит");
	ОбластьИтого.Параметры.ИтогоСуммаОстаток = РезультатЗапроса.Итог("СуммаОстаток");
	ОбластьИтого.Параметры.ИтогоОтклонение = ИтогоОтклонение;
	
	Результат.Вывести(ОбластьИтого);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардов(Дата, Отделение)
	
	Условие = "";
	
	Если Отделение = Неопределено Тогда
	//	Условие = "НЕ Отделение.Наименование ПОДОБНО ""%Екатеринбург%""
	//		|				И НЕ Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)";
		Условие = "НЕ Ломбард.Закрыт";
	Иначе
		Условие = "Отделение В (&Отделение)
				|				И НЕ Ломбард.Закрыт";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,"
		+ Символы.ПС + Условие + Символы.ПС
		+ "				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокВозврата = Новый СписокЗначений;
	
	Пока РезультатЗапроса.Следующий() Цикл
		СписокВозврата.Добавить(РезультатЗапроса.Ломбард);
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции

&НаСервере
Функция ПроверкаЧислаНаЧетность(ВходящееЧисло) Экспорт
   РезультатВычисления = ВходящееЧисло%2 = 0; //Четное = Истина
   Возврат РезультатВычисления; //Возвращает Булево
КонецФункции
